# GetTargetElement Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetTargetElement Method (Int32)
RebarConstraint Class See Also
---
Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Element GetTargetElement(
	int targetIndex
)
```

Visual Basic
---
```text
Public Function GetTargetElement ( _
	targetIndex As Integer _
) As Element
```

Visual C++
---
```text
public:
Element^ GetTargetElement(
	int targetIndex
)
```

# ### Parameters
targetIndex
    Type: System..::..Int32 The index of the target. Should be between 0 and NumberOfTargets().
# ### Return Value
Returns the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | targetIndex is out of range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. |

# See Also
RebarConstraint Class
GetTargetElement Overload
Autodesk.Revit.DB.Structure Namespace